Repository: cgallego17/NSC-INTERNATIONAL
Catalog: locale/*/LC_MESSAGES/djangojs.po
Languages: es

source: Solution
es: Solución

source: Assign guests
es: Asignar huéspedes

source: Remove room from selection
es: Quitar habitación de la selección

source: Auto-distribute
es: Auto-asignar

source: Done
es: Listo

source: Assign guests to {room}
es: Asignar huéspedes a {room}

source: Selected: {room}
es: Seleccionada: {room}

source: Selected rooms: {count}
es: Habitaciones seleccionadas: {count}

source: Not enough rooms available (max capacity {max})
es: No hay suficientes habitaciones disponibles (capacidad máxima {max})

source: Need a bigger room for {guests} guests
es: Necesitas una habitación más grande para {guests} huéspedes

source: No more rooms available to add
es: No hay más habitaciones disponibles para agregar

source: Need +{diff} capacity (add room)
es: Falta +{diff} de capacidad (agregar habitación)

source: Change to a bigger room
es: Cambiar a una habitación más grande

source: Replace a room
es: Reemplazar una habitación

source: {count} room(s) selected! Ready to continue.
es: ¡{count} habitación(es) seleccionada(s)! Listo para continuar.

source: No guests assigned to: {rooms}
es: No hay huéspedes asignados a: {rooms}

source: Occupancy rules per room not met: {details}
es: No se cumplen las reglas de ocupación por habitación: {details}

source: {guests} guest(s) exceed {cap} capacity by {diff}
es: {guests} huésped(es) exceden la capacidad {cap} por {diff}

source: Not enough rooms available: max capacity is {max} but you have {guests} guests
es: No hay suficientes habitaciones disponibles: la capacidad máxima es {max} y tienes {guests} huéspedes

source: Auto-assign guests
es: Auto-asignar huéspedes

source: Assign now
es: Asignar ahora

source: Add room for {diff} guest(s)
es: Agregar habitación para {diff} huésped(es)

source: You have {guests} guests but this room fits {cap}. Change to a bigger room that fits everyone.
es: Tienes {guests} huéspedes pero esta habitación tiene capacidad {cap}. Cambia a una habitación más grande que acomode a todos.

source: You have {guests} guests but this room fits {cap}. Add another room for the remaining guests.
es: Tienes {guests} huéspedes pero esta habitación tiene capacidad {cap}. Agrega otra habitación para los huéspedes restantes.

source: Occupancy rules are not being met for this room
es: No se están cumpliendo las reglas de ocupación de esta habitación

source: Not meeting occupancy rules
es: No cumple reglas de ocupación

source: The current assignment ({adults} adults, {children} children) does not match any occupancy rule.
es: La asignación actual ({adults} adultos, {children} niños) no cumple ninguna regla de ocupación.

source: Unknown error
es: Error desconocido

source: Recommended for {guests} guest(s)
es: Recomendado para {guests} huésped(es)

source: Recommended to add capacity
es: Recomendado para agregar capacidad

source: at least {n} {noun}
es: al menos {n} {noun}

source: exactly {n} {noun}
es: exactamente {n} {noun}

source: between {min} and {max} {noun}
es: entre {min} y {max} {noun}

source: adult
es: adulto

source: adults
es: adultos

source: child
es: niño

source: children
es: niños

source: Now you have: {adults} {adultWord} and {children} {childWord}.
es: Ahora tienes: {adults} {adultWord} y {children} {childWord}.

source: Requirement:
es: Requisito:

source: {adultsReq} and {childrenReq}.
es: {adultsReq} y {childrenReq}.

source: You need to add {n} {noun}.
es: Te falta agregar {n} {noun}.

source: You have {n} extra {noun}.
es: Tienes {n} {noun} de más.

source: This room fits {cap} guests, but you have {guests} guests. Please adjust guests or choose another room.
es: Esta habitación tiene capacidad para {cap} huéspedes, pero tú tienes {guests}. Ajusta los huéspedes o elige otra habitación.

source: Room capacity ({cap}) reached. Cannot assign more guests.
es: Se alcanzó la capacidad de la habitación ({cap}). No puedes asignar más huéspedes.

source: {count} room(s) selected. Click Continue to proceed
es: {count} habitación(es) seleccionada(s). Presiona Continuar para seguir

source: At least one adult required
es: Se requiere al menos 1 adulto

source: Guests must be assigned to every selected room
es: Debes asignar huéspedes a cada habitación seleccionada

source: Per-room occupancy rules not met
es: No se cumplen reglas por habitación

source: Capacity exceeded
es: Capacidad excedida

source: Cannot continue
es: No puedes continuar

source: Please fix these errors
es: Por favor corrige estos errores

source: Please select a room from the list below
es: Selecciona una habitación de la lista de abajo

source: Please select a room to continue
es: Selecciona una habitación para continuar

source: Please select at least one room to continue
es: Selecciona al menos una habitación para continuar

source: Select a new room to replace the previous one
es: Selecciona una nueva habitación para reemplazar la anterior

source: To replace a room, deselect one and select another
es: Para reemplazar una habitación, deselecciona una y selecciona otra

source: Please select at least one room first
es: Selecciona al menos una habitación primero

source: You have {guests} guests but selected {rooms} rooms. Some rooms will remain without guests.
es: Tienes {guests} huéspedes pero seleccionaste {rooms} habitaciones. Algunas quedarán sin huéspedes.

source: Auto-assign completed, but some rooms still have no guests. Please assign manually.
es: Auto-asignación completada, pero algunas habitaciones aún no tienen huéspedes. Por favor, asigna manualmente.

source: Guests auto-assigned across selected rooms.
es: Huéspedes auto-asignados en las habitaciones seleccionadas.

source: Price breakdown ({count} room(s)):
es: Desglose de precios ({count} habitación(es)):

source: Assigned: {names}
es: Asignados: {names}

source: None
es: Ninguno

source: No guests assigned to this room
es: No hay huéspedes asignados a esta habitación

source: Occupancy rules satisfied
es: Reglas de ocupación cumplidas

source: Capacity: {total} guest(s) ({adults} adult(s), {children} child(ren)) / {totalCapacity} total capacity ({rooms} room(s))
es: Capacidad: {total} huésped(es) ({adults} adulto(s), {children} niño(s)) / {totalCapacity} capacidad total ({rooms} habitación(es))

source: Capacity: {cap} guests
es: Capacidad: {cap} huéspedes

source: Currently assigned: {total} ({adults} adult(s), {children} child(ren))
es: Asignados actualmente: {total} ({adults} adulto(s), {children} niño(s))

source: Complies
es: Cumple

source: Current assignment complies with {n} rule(s).
es: La asignación actual cumple {n} regla(s).

source: Available rules:
es: Reglas disponibles:

source: Attention
es: Atención

source: Correct
es: Correcto

source: You must have at least 1 adult
es: Debes tener al menos 1 adulto

source: Occupancy rules are not being met
es: Las reglas de ocupación no se están cumpliendo

source: Occupancy rules are not being met for: {rooms}
es: Las reglas de ocupación no se están cumpliendo en: {rooms}

source: Cannot remove this room. Remaining capacity ({remaining}) would be insufficient for {guests} guests.
es: No puedes quitar esta habitación. La capacidad restante ({remaining}) no alcanza para {guests} huéspedes.

source: You have {guests} guests. Instead of selecting multiple rooms, you can use a single bigger room: - {label} (capacity {cap}) Do you want to replace your current selection with this room?
es: Tienes {guests} huéspedes. En vez de seleccionar varias habitaciones, puedes usar una sola habitación más grande: - {label} (capacidad {cap}) ¿Quieres reemplazar tu selección actual por esta habitación?

source: Switched to "{label}" to fit all guests in one room.
es: Cambiamos a "{label}" para acomodar a todos en una sola habitación.

source: Adding this room would give you {cap} total capacity, but you have {guests} guests. Please add another room or change to a room with higher capacity.
es: Al agregar esta habitación tendrías capacidad total para {cap}, pero tienes {guests} huéspedes. Agrega otra habitación o cambia a una con mayor capacidad.

source: Adding this room would give you {cap} total capacity, but you have {guests} guests. Please select more rooms or adjust guests.
es: Al agregar esta habitación tendrías capacidad total para {cap}, pero tienes {guests} huéspedes. Selecciona más habitaciones o ajusta los huéspedes.

source: Room "{label}" removed from selection
es: Habitación "{label}" removida de la selección

source: Room "{label}" added ({count} selected)
es: Habitación "{label}" agregada ({count} seleccionada(s))

source: You already have enough capacity with {count} room(s) ({cap} guests). Do you want to add another room anyway?
es: Ya tienes capacidad suficiente con {count} habitación(es) ({cap} huéspedes). ¿Aun así quieres agregar otra habitación?

source: Room selected! Ready to continue.
es: ¡Habitación seleccionada! Listo para continuar.

source: No amenities listed.
es: No hay amenidades disponibles.

source: No occupancy rules defined for this room. Any combination of guests is allowed.
es: Esta habitación no tiene reglas de ocupación definidas. Cualquier combinación de huéspedes está permitida.

source: Total guests ({total}) exceeds total room capacity ({cap}).
es: El total de huéspedes ({total}) excede la capacidad total ({cap}).

source: Please add another room or change to a room with higher capacity to accommodate all {total} guest(s).
es: Agrega otra habitación o cambia a una con mayor capacidad para acomodar a los {total} huésped(es).

source: Matching rule:
es: Regla que se cumple:

source: Your selection ({adults} adults, {children} children) matches the occupancy rules.
es: Tu selección ({adults} adultos, {children} niños) cumple las reglas de ocupación.

source: Your selection ({adults} adults, {children} children) matches {n} rule(s).
es: Tu selección ({adults} adultos, {children} niños) cumple {n} regla(s).

source: Your selection ({adults} adults, {children} children) does not match any occupancy rule.
es: Tu selección ({adults} adultos, {children} niños) no cumple ninguna regla de ocupación.

source: In this hotel, all rooms require at least 1 child. Your group includes 0 children.
es: En este hotel, todas las habitaciones requieren al menos 1 niño. Tu grupo no incluye niños.

source: In this hotel, no room allows children (max children = 0 for all rooms).
es: En este hotel, ninguna habitación permite niños (máximo de niños = 0 en todas).

source: In this hotel, no room allows adults (max adults = 0 for all rooms).
es: En este hotel, ninguna habitación permite adultos (máximo de adultos = 0 en todas).

source: Too many children for the available rooms (max children allowed: {max}).
es: Hay demasiados niños para las habitaciones disponibles (máximo total permitido de niños: {max}).

source: Too many adults for the available rooms (max adults allowed: {max}).
es: Hay demasiados adultos para las habitaciones disponibles (máximo total permitido de adultos: {max}).

source: No available rooms are compatible with your guest mix.
es: No hay habitaciones disponibles compatibles con tu grupo.

source: Full Name
es: Nombre completo

source: Email
es: Correo electrónico

source: Phone
es: Teléfono

source: Date of Birth
es: Fecha de nacimiento

source: You must select at least one player or add at least one child
es: Debes seleccionar al menos un jugador o agregar al menos un niño

source: Rooms modal not found
es: Modal de habitaciones no encontrado

source: Player
es: Jugador

source: Player (Adult)
es: Jugador (Adulto)

source: Player (Child)
es: Jugador (Niño)

source: Room
es: Habitación

source: Room %(id)s
es: Habitación %(id)s

source: Loading...
es: Cargando...

source: No description available.
es: No hay descripción disponible.

source: person
es: persona

source: people
es: personas

source: guest
es: huésped

source: night
es: noche

source: Included
es: Incluido

source: Not included
es: No incluido

source: Room image %(num)s
es: Imagen de habitación %(num)s

source: Adults: %(minAdults)s-%(maxAdults)s • Children: %(minChildren)s-%(maxChildren)s
es: Adultos: %(minAdults)s-%(maxAdults)s • Niños: %(minChildren)s-%(maxChildren)s

source: Failed to load room details. Please try again.
es: Error al cargar los detalles de la habitación. Por favor, inténtalo de nuevo.

source: Error loading room
es: Error al cargar la habitación

source: Hotel reservation added to checkout
es: Reserva de hotel agregada al checkout

source: Hotel Stay
es: Estancia en Hotel

source: Main Contact
es: Contacto Principal

source: Total Guests
es: Total de Huéspedes

source: additional adults
es: adultos adicionales

source: additional adult
es: adulto adicional

source: additional children
es: niños adicionales

source: additional child
es: niño adicional

source: Base price
es: Precio base

source: Room Total
es: Total de Habitación

source: capacity
es: capacidad

source: Total (All Rooms)
es: Total (todas las habitaciones)

source: Exceeds capacity by
es: Supera la capacidad por
